[
  {
    "Name": "Вывести заказ по UUID | Only auth",
    "Desc": "Вывести заказ по UUID. Обязательно предоставление соответствующего авторизационного токена, чтобы доказать, что он принадлежит вам.",
    "URL": "GET/order/uuid",
    "Params": [
      {
        "Name": "uuid",
        "IsRequired": true
      }
    ]
  },
  {
    "Name": "Вывести заказы в ожидании",
    "Desc": "Вывести список из 20 заказов, подлежащих оплате, отсортированный по времени создания. По вопросу разбивки на страницы, можно по желанию указать параметр before (в формате ISO 8601), с задачей предоставить в ответ 20 заказов, размещенных непосредственно перед заданным временем.",
    "URL": "GET/orders/pending",
    "Params": [
      {
        "Name": "before",
        "IsRequired": false
      }
    ]
  },
  {
    "Name": "Вывести очередь заказов",
    "Desc": "Получить список оплаченных, но неотправленных заказов в порядке убывания ставки за байт.  Возвращаются как отложенные ордера, так и ордер, передаваемый в данный момент.  При необходимости принимает параметр, указывающий, сколько заказов в очереди нужно вернуть.",
    "URL": "GET/orders/queued",
    "Params": [
      {
        "Name": "limit",
        "IsRequired": false
      }
    ]
  },
  {
    "Name": "Вывести список отправленных заказов",
    "Desc": "Выводит список, состоящий из максимум 20 отправленных заказов в обратном хронологическом порядке. По вопросу разбивки на страницы, можно по желанию указать параметр before (в формате ISO 8601), в котором велено предоставить в ответ 20 заказов, размещенных непосредственно перед заданным временем.",
    "URL": "GET/orders/sent",
    "Params": [
      {
        "Name": "before",
        "IsRequired": false
      }
    ]
  },
  {
    "Name": "Вывести информацию об узле CoreLightning",
    "Desc": "Возвращает информацию об узле Core Lightning, на котором прекращаются платежи через спутниковые API.  Ответ представляет собой объект JSON, состоящий из идентификатора узла, порта, IP-адресов и другой информации, полезной для открытия платежных каналов.",
    "URL": "GET/info",
    "Params": []
  },
  {
    "Name": "Размещение заказа на передачу сообщения",
    "Desc": "Разместите заказ на передачу сообщения. В теле POST должна быть предоставлена bid в миллисатоши и сообщение в виде параметра строки message или в загруженной формы HTTP file. Если размер заявки на покупу ниже минимального размера миллисатоши на байт, возвращается ошибка BID_TOO_SMALL (102).",
    "URL": "POST /order",
    "Params": [
      {
        "Name": "bid",
        "IsRequired": true
      },
      {
        "Name": "message",
        "IsRequired": true
      }
    ]
  },

  {
    "Name": "Увеличить размер заявки в очереди на передачу",
    "Desc": "Увеличить размер заявки, стоящей в очередности передачи. bid_increase должен быть предоставлен в теле POST. В ответ приходит инвойс Lightning и после его оплаты разница добавляется к текущей заявке. Также надо предоставить auth_token.",
    "URL": "POST /order/:uuid/bump",
    "Params": [
      {
        "Name": "uuid",
        "IsRequired": true
      },
      {
        "Name": "bid_increase",
        "IsRequired": true
      },
      {
        "Name": "auth_token",
        "IsRequired": true
      }
    ]
  },

  {
    "Name": "Отмена заказа",
    "Desc": "Чтобы отменить заказ, надо выдать запрос HTTP DELETE конечной точке API /order/:uuid/, предоставив UUID заказа. Также надо предоставить auth_token.",
    "URL": "DELETE /order/:uuid",
    "Params": [
      {
        "Name": "uuid",
        "IsRequired": true
      },
      {
        "Name": "auth_token",
        "IsRequired": true
      }
    ]
  },

  {
    "Name": "Вывести информацию об узле CoreLightning",
    "Desc": "Возвращает информацию об узле Core Lightning, на котором прекращаются платежи через спутниковые API.  Ответ представляет собой объект JSON, состоящий из идентификатора узла, порта, IP-адресов и другой информации, полезной для открытия платежных каналов.",
    "URL": "GET /subscribe/:channels",
    "Params": [
      {
        "Name": "channels",
        "IsRequired": true
      }
    ]
  }
]
